RESTful-API-RSA-Cryptosystem/app/controllers/decrypt_messages_controller.rb

SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "decrypt_messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "asdf뀝"], ["created_at", "2017-12-19 23:12:13.468444"], ["updated_at", "2017-12-19 23:12:13.468444"]]
---
	def create
		message = DecryptMessage.new({ :content => message_params[:message] })

		if message.content == nil
			render :html => "No message"
		else
			key = Key.find(params[:id])

			rsa = RSA.new(key.n, key.e, key.d)

			message.content = rsa.decrypt(message.content)

			respond_to do |format|
				if message.save