RESTful-API-RSA-Cryptosystem/app/controllers/encrypt_messages_controller.rb

	def create
		message = EncryptMessage.new({ :content => message_params[:message] })

		if message.content == nil
			render :html => "No message"
		else
			key = Key.find(params[:id])

			rsa = RSA.new(key.n, key.e, key.d)

			message.content = rsa.encrypt(message.content)

			respond_to do |format|
				if message.save
---
SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "encrypt_messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)

	def show
		message = EncryptMessage.find(params[:id])
---
SELECT  "encrypt_messages".* FROM "encrypt_messages" WHERE "encrypt_messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]