RESTful-API-RSA-Cryptosystem/app/controllers/keys_controller.rb

INSERT INTO "keys" ("n", "e", "d", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["n", 119837], ["e", 65537], ["d", 16601], ["created_at", "2017-12-19 23:10:50.080692"], ["updated_at", "2017-12-19 23:10:50.080692"]]
---
	def create
		key = Key.new(key_params)

		if(!params.has_key?(:n) || !params.has_key?(:e) || !params.has_key?(:d))
			keyParams = RSA.new(0, 0, 0).new_key

			key.n = keyParams[0]
			key.e = keyParams[1]
			key.d = keyParams[2]
 		end

		respond_to do |format|
			if key.save

SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		key = Key.find(params[:id])